In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                 'class':[9,10,11,12]})
df1

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

In [3]:
df2=pd.DataFrame({'ID':[1,2,3,4,5],
                 'name':['A','B','C','D','E']})
df2

   ID name
0   1    A
1   2    B
2   3    C
3   4    D
4   5    E

In [6]:
print(pd.concat([df1, df2],axis='columns').drop)

    ID  class  ID name
0  1.0    9.0   1    A
1  2.0   10.0   2    B
2  3.0   11.0   3    C
3  4.0   12.0   4    D
4  NaN    NaN   5    E

In [8]:
df=pd.read_csv('d:\datasets\Restaurant - Foods.csv')
df.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [9]:
week1=pd.read_csv("d:\datasets\Restaurant - Week 1 Sales.csv")
week2=pd.read_csv("d:\datasets\Restaurant - Week 2 Sales.csv")
customers=pd.read_csv("d:\datasets\Restaurant - Customers.csv")
foods=pd.read_csv("d:\datasets\Restaurant - Foods.csv")

In [10]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [11]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [13]:
week1.merge(week2,on=['Customer ID','Food ID']).head()

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4

In [14]:
week1[week1["Customer ID"]==578]

     Customer ID  Food ID
224          578        5

In [15]:
merge=week1.merge(week2,how="outer",on="Customer ID",suffixes=["-week 1","-week 2"],indicator=True)

In [16]:
merge.head()

   Customer ID  Food ID-week 1  Food ID-week 2     _merge
0          537             9.0             5.0       both
1           97             4.0             NaN  left_only
2          658             1.0             NaN  left_only
3          202             2.0             NaN  left_only
4          155             9.0             3.0       both

In [17]:
merge["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [18]:
mask=merge["_merge"].isin(["left_only","right_only"])
abc=merge[mask]

In [19]:
abc.head()

   Customer ID  Food ID-week 1  Food ID-week 2     _merge
1           97             4.0             NaN  left_only
2          658             1.0             NaN  left_only
3          202             2.0             NaN  left_only
6          213             8.0             NaN  left_only
7          600             1.0             NaN  left_only